Pandas

Series are used to work with one dimensional array, whereas DataFrame can be used with two dimensional arrays. DataFrame has two different index i.e.column-index and row-index.

In [7]:
import pandas as pd

#converting tuple to series
tuple_data = ('aasai',23,'Engineer','Korea')
series = pd.Series(tuple_data,index=['name','age','profession','Loaction'])
print(series)
type(series)

name             aasai
age                 23
profession    Engineer
Loaction         Korea
dtype: object

pandas.core.series.Series

In [8]:
#converting dictionary to series

dict_data = {'name':'aasai','age':23,'Profession':'Engineer','Location':'Korea'}
series = pd.Series(dict_data)
print(series)
type(series)

name             aasai
age                 23
Profession    Engineer
Location         Korea
dtype: object

pandas.core.series.Series

In [9]:
#Elements of the Series can be accessed using index name e.g. f[‘shares’] or f[0]

dict_data['name']
tuple_data[0]

'aasai'

In [10]:
data = {'name':['aasai','praveen','nanda'],
       'age':[23,23,23],
       'Profession':['Engineer','Engineer','Engineer'],
       'native':['Coimbatore','Mayavaram','Thiruvallur']
       }
Data_frame = pd.DataFrame(data,index=['one','two','three'])
print(Data_frame)

          name  age Profession       native
one      aasai   23   Engineer   Coimbatore
two    praveen   23   Engineer    Mayavaram
three    nanda   23   Engineer  Thiruvallur

In [11]:
type(Data_frame)

pandas.core.frame.DataFrame

In [12]:
#Added Additional Column
Data_frame['country'] = ['India','India','India']
print(Data_frame)

          name  age Profession       native country
one      aasai   23   Engineer   Coimbatore   India
two    praveen   23   Engineer    Mayavaram   India
three    nanda   23   Engineer  Thiruvallur   India

In [13]:
#.loc for label based indexing or
#.iloc for positional indexing
Data_frame.loc['one']
Data_frame.iloc[0]

name               aasai
age                   23
Profession      Engineer
native        Coimbatore
country            India
Name: one, dtype: object

In [14]:
#All rows and first column access
Data_frame.iloc[:,0]
Data_frame.loc[:,'name']

one        aasai
two      praveen
three      nanda
Name: name, dtype: object

In [15]:
#All column and First row access
Data_frame.iloc[0,:]
Data_frame.loc['one',:]

name               aasai
age                   23
Profession      Engineer
native        Coimbatore
country            India
Name: one, dtype: object

In [16]:
#Access first row and third column syntax for accessing specific data
Data_frame.iloc[0,2]
#output : Engineer
Data_frame.loc['one','age']

23

In [17]:
#delete Profession column usingg del command
del Data_frame['Profession']
Data_frame

          name  age       native country
one      aasai   23   Coimbatore   India
two    praveen   23    Mayavaram   India
three    nanda   23  Thiruvallur   India

In [18]:
#Replace Aasai native to madurai using replace
Data_frame.replace(to_replace = 'Coimbatore',value = 'Madurai')
#Replace using location
Data_frame.loc['one','native'] = 'Madurai'
Data_frame

          name  age       native country
one      aasai   23      Madurai   India
two    praveen   23    Mayavaram   India
three    nanda   23  Thiruvallur   India

In [19]:
#Creating a Series by passing a list of values and set index by series of date
series = pd.Series(['one','Two','Three'],index = pd.date_range('20191101',periods=3))
series

2019-11-01      one
2019-11-02      Two
2019-11-03    Three
Freq: D, dtype: object

In [20]:
#create dataframe using numpy
import numpy as np
data_frame = pd.DataFrame(np.random.randint(1,10,size=(6,4)),index = pd.date_range('20191101',periods = 6))
data_frame

            0  1  2  3
2019-11-01  6  1  1  9
2019-11-02  7  9  1  3
2019-11-03  2  1  5  1
2019-11-04  8  9  1  6
2019-11-05  5  1  8  4
2019-11-06  3  3  2  8

In [21]:
#column name added
data_frame = pd.DataFrame(np.random.randint(1,10,size=(6,4)),index = pd.date_range('20191101',periods = 6),columns = ['a','b','c','d'])
data_frame

            a  b  c  d
2019-11-01  8  9  6  3
2019-11-02  6  9  3  2
2019-11-03  5  7  8  8
2019-11-04  7  2  4  1
2019-11-05  8  1  1  1
2019-11-06  6  8  1  5

In [22]:
#Display the index, columns
print(data_frame.index)
print(data_frame.columns)

DatetimeIndex(['2019-11-01', '2019-11-02', '2019-11-03', '2019-11-04',
               '2019-11-05', '2019-11-06'],
              dtype='datetime64[ns]', freq='D')
Index(['a', 'b', 'c', 'd'], dtype='object')

In [23]:
#Display top rows and bottom rows
print(data_frame.head(3)) #first 3 rows
print(data_frame.tail(3)) #last 3 rows

            a  b  c  d
2019-11-01  8  9  6  3
2019-11-02  6  9  3  2
2019-11-03  5  7  8  8
            a  b  c  d
2019-11-04  7  2  4  1
2019-11-05  8  1  1  1
2019-11-06  6  8  1  5

In [24]:
#describe() shows a quick statistic summary of your data
data_frame.describe()

              a         b         c         d
count  6.000000  6.000000  6.000000  6.000000
mean   6.666667  6.000000  3.833333  3.333333
std    1.211060  3.577709  2.786874  2.732520
min    5.000000  1.000000  1.000000  1.000000
25%    6.000000  3.250000  1.500000  1.250000
50%    6.500000  7.500000  3.500000  2.500000
75%    7.750000  8.750000  5.500000  4.500000
max    8.000000  9.000000  8.000000  8.000000

In [25]:
#change values by index
data_frame.iat[0,1] = 10

In [26]:
data_frame

            a   b  c  d
2019-11-01  8  10  6  3
2019-11-02  6   9  3  2
2019-11-03  5   7  8  8
2019-11-04  7   2  4  1
2019-11-05  8   1  1  1
2019-11-06  6   8  1  5

In [27]:
#change values by label
data_frame.at['20191101','a'] = 4

In [28]:
#Transpose Your data
data_frame.T

   2019-11-01  2019-11-02  2019-11-03  2019-11-04  2019-11-05  2019-11-06
a           4           6           5           7           8           6
b          10           9           7           2           1           8
c           6           3           8           4           1           1
d           3           2           8           1           1           5

In [30]:
#Sort By an axis ascending oredered column
data_frame.sort_index(axis=1,ascending = True)

            a   b  c  d
2019-11-01  4  10  6  3
2019-11-02  6   9  3  2
2019-11-03  5   7  8  8
2019-11-04  7   2  4  1
2019-11-05  8   1  1  1
2019-11-06  6   8  1  5

In [31]:
data_frame.sort_index(axis=1,ascending = False)

            d  c   b  a
2019-11-01  3  6  10  4
2019-11-02  2  3   9  6
2019-11-03  8  8   7  5
2019-11-04  1  4   2  7
2019-11-05  1  1   1  8
2019-11-06  5  1   8  6

In [42]:
#sort specific index value here sort b index value
data_frame.sort_values(by='b',ascending = False)

            a   b  c  d
2019-11-01  4  10  6  3
2019-11-02  6   9  3  2
2019-11-06  6   8  1  5
2019-11-03  5   7  8  8
2019-11-04  7   2  4  1
2019-11-05  8   1  1  1

In [43]:
data_frame.sort_values(by='b',ascending = True)

            a   b  c  d
2019-11-05  8   1  1  1
2019-11-04  7   2  4  1
2019-11-03  5   7  8  8
2019-11-06  6   8  1  5
2019-11-02  6   9  3  2
2019-11-01  4  10  6  3

In [48]:
data_frame.loc[:,'e'] = np.array(2)*len(data_frame)
data_frame

            a   b  c  d   e
2019-11-01  4  10  6  3  12
2019-11-02  6   9  3  2  12
2019-11-03  5   7  8  8  12
2019-11-04  7   2  4  1  12
2019-11-05  8   1  1  1  12
2019-11-06  6   8  1  5  12

In [50]:
#copying data
data_frame2 = data_frame.copy() 
data_frame2

            a   b  c  d   e
2019-11-01  4  10  6  3  12
2019-11-02  6   9  3  2  12
2019-11-03  5   7  8  8  12
2019-11-04  7   2  4  1  12
2019-11-05  8   1  1  1  12
2019-11-06  6   8  1  5  12

In [51]:
del data_frame2['a']

In [52]:
data_frame2

             b  c  d   e
2019-11-01  10  6  3  12
2019-11-02   9  3  2  12
2019-11-03   7  8  8  12
2019-11-04   2  4  1  12
2019-11-05   1  1  1  12
2019-11-06   8  1  5  12

In [76]:
data_frame.fillna(value=2)

              a  b  c  d  e
2019-11-01  4.0  0  0  3  0
2019-11-02  2.0  0  3  2  0
2019-11-03  5.0  0  0  0  0
2019-11-04  2.0  2  4  1  0
2019-11-05  2.0  1  1  1  0
2019-11-06  2.0  0  1  5  0

In [79]:
data_frame

              a  b  c  d  e
2019-11-01  4.0  0  0  3  0
2019-11-02  NaN  0  3  2  0
2019-11-03  5.0  0  0  0  0
2019-11-04  NaN  2  4  1  0
2019-11-05  NaN  1  1  1  0
2019-11-06  NaN  0  1  5  0

In [78]:
# if value is not o False else True
pd.isna(data_frame)

                a      b      c      d      e
2019-11-01  False  False  False  False  False
2019-11-02   True  False  False  False  False
2019-11-03  False  False  False  False  False
2019-11-04   True  False  False  False  False
2019-11-05   True  False  False  False  False
2019-11-06   True  False  False  False  False

In [80]:
#Working with strings
s = pd.Series(['A','B','C'])
s

0    A
1    B
2    C
dtype: object

In [81]:
#convert string to lower case
s.str.lower()

0    a
1    b
2    c
dtype: object